In [59]:
import pandas as pd

In [60]:
#df = pd.read_csv("rental.csv")

In [ ]:
df.to_sql()

In [61]:
df= df.drop('last_update', axis=1)

In [62]:
df.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

In [63]:
df.info

<bound method DataFrame.info of      rental_id          rental_date  inventory_id  customer_id  \
0            1  2005-05-24 22:53:30           367          130
1            2  2005-05-24 22:54:33          1525          459
2            3  2005-05-24 23:03:39          1711          408
3            4  2005-05-24 23:04:41          2452          333
4            5  2005-05-24 23:05:21          2079          222
..         ...                  ...           ...          ...
995        997  2005-05-31 00:08:25          4243          216
996        998  2005-05-31 00:16:57          3395          389
997        999  2005-05-31 00:25:10          4433          413
998       1000  2005-05-31 00:25:56          1774          332
999       1001  2005-05-31 00:46:31          1498           64

             return_date  staff_id
0    2005-05-26 22:04:30         1
1    2005-05-28 19:40:33         1
2    2005-06-01 22:12:39         1
3    2005-06-03 01:43:41         2
4    2005-06-02 04:33:21         1
..                   ...       ...
995  2005-06-02 00:17:25         2
996  2005-06-01 22:41:57         1
997  2005-06-03 06:05:10         2
998  2005-06-08 19:42:56         2
999  2005-06-06 06:14:31         2

[1000 rows x 6 columns]>

In [64]:
df.shape

(1000, 6)

In [65]:
print(df.describe())

        rental_id  inventory_id  customer_id     staff_id
count  1000.00000   1000.000000  1000.000000  1000.000000
mean    501.18000   2258.179000   296.408000     1.521000
std     289.19665   1314.667454   172.509319     0.499809
min       1.00000      2.000000     1.000000     1.000000
25%     250.75000   1157.500000   150.000000     1.000000
50%     501.50000   2244.500000   296.000000     2.000000
75%     751.25000   3371.750000   445.250000     2.000000
max    1001.00000   4581.000000   597.000000     2.000000

In [66]:
df.describe()

        rental_id  inventory_id  customer_id     staff_id
count  1000.00000   1000.000000  1000.000000  1000.000000
mean    501.18000   2258.179000   296.408000     1.521000
std     289.19665   1314.667454   172.509319     0.499809
min       1.00000      2.000000     1.000000     1.000000
25%     250.75000   1157.500000   150.000000     1.000000
50%     501.50000   2244.500000   296.000000     2.000000
75%     751.25000   3371.750000   445.250000     2.000000
max    1001.00000   4581.000000   597.000000     2.000000

In [67]:
df.columns

Index(['rental_id', 'rental_date', 'inventory_id', 'customer_id',
       'return_date', 'staff_id'],
      dtype='object')

In [68]:
df.info

<bound method DataFrame.info of      rental_id          rental_date  inventory_id  customer_id  \
0            1  2005-05-24 22:53:30           367          130
1            2  2005-05-24 22:54:33          1525          459
2            3  2005-05-24 23:03:39          1711          408
3            4  2005-05-24 23:04:41          2452          333
4            5  2005-05-24 23:05:21          2079          222
..         ...                  ...           ...          ...
995        997  2005-05-31 00:08:25          4243          216
996        998  2005-05-31 00:16:57          3395          389
997        999  2005-05-31 00:25:10          4433          413
998       1000  2005-05-31 00:25:56          1774          332
999       1001  2005-05-31 00:46:31          1498           64

             return_date  staff_id
0    2005-05-26 22:04:30         1
1    2005-05-28 19:40:33         1
2    2005-06-01 22:12:39         1
3    2005-06-03 01:43:41         2
4    2005-06-02 04:33:21         1
..                   ...       ...
995  2005-06-02 00:17:25         2
996  2005-06-01 22:41:57         1
997  2005-06-03 06:05:10         2
998  2005-06-08 19:42:56         2
999  2005-06-06 06:14:31         2

[1000 rows x 6 columns]>

In [69]:
df.isnull()

     rental_id  rental_date  inventory_id  customer_id  return_date  staff_id
0        False        False         False        False        False     False
1        False        False         False        False        False     False
2        False        False         False        False        False     False
3        False        False         False        False        False     False
4        False        False         False        False        False     False
..         ...          ...           ...          ...          ...       ...
995      False        False         False        False        False     False
996      False        False         False        False        False     False
997      False        False         False        False        False     False
998      False        False         False        False        False     False
999      False        False         False        False        False     False

[1000 rows x 6 columns]